CF/Catalogs/ИнтервалыРаботыМагазинов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ИнтервалыРаботыМагазинов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоИнтервала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеИнтервала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаРабочегоВремени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДниНедели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаботыВыполняемыеСотрудниками</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РаботаВыполняемаяСотрудниками</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РаботаВыполняемаяСотрудниками</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСотрудников</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/Catalogs/ИнтервалыРаботыМагазинов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	ОбновитьПоказателиВремениНаСервере();
	
	ЗаполнитьСписокДнейНедели();
	
	ОбновитьПоказателиВремениНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СохранитьСписокДнейНедели(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДлинаРабочегоВремениПриИзменении(Элемент)
	
	РассчитатьНерабочееВремя();
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоИнтервалаПриИзменении(Элемент)
	
	ОбновитьПоказателиВремени();
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеИнтервалаПриИзменении(Элемент)
	
	ОбновитьПоказателиВремени();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокДнейНедели()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТаблицаДнейНедели.Значение,
	                      |	МАКСИМУМ(ТаблицаДнейНедели.Пометка) КАК Пометка,
	                      |	ТаблицаДнейНедели.Порядок КАК Порядок
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ДниНедели.Ссылка КАК Значение,
	                      |		ЛОЖЬ КАК Пометка,
	                      |		ДниНедели.Порядок КАК Порядок
	                      |	ИЗ
	                      |		Перечисление.ДниНедели КАК ДниНедели
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Интервалы.ДеньНедели,
	                      |		ИСТИНА,
	                      |		Интервалы.ДеньНедели.Порядок
	                      |	ИЗ
	                      |		Справочник.ИнтервалыРаботыМагазинов.ДниНедели КАК Интервалы
	                      |	ГДЕ
	                      |		Интервалы.Ссылка = &Ссылка) КАК ТаблицаДнейНедели
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТаблицаДнейНедели.Значение,
	                      |	ТаблицаДнейНедели.Порядок
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Порядок");
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДниНеделиСписок.Добавить(Выборка.Значение,,Выборка.Пометка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоказателиВремени()
	
	Объект.НачалоИнтервала    = Дата(1,1,1,Час(Объект.НачалоИнтервала),Минута(Объект.НачалоИнтервала),0);
	Объект.ОкончаниеИнтервала = Дата(1,1,1,Час(Объект.ОкончаниеИнтервала),Минута(Объект.ОкончаниеИнтервала),0);
	
	Если Объект.ОкончаниеИнтервала < Объект.НачалоИнтервала Тогда	
		
		ОкончаниеИнтервала = Объект.ОкончаниеИнтервала + 86400;
		
	Иначе
		
		ОкончаниеИнтервала = Объект.ОкончаниеИнтервала;
		
	КонецЕсли;
	
	РазностьВСекундах = ОкончаниеИнтервала - Объект.НачалоИнтервала;
	
	Если РазностьВСекундах > 0 Тогда
		
		Объект.ДлинаРабочегоВремени   = ОбщегоНазначенияРТКлиентСервер.ПреобразоватьСекундыВДату(РазностьВСекундах);
		ДлинаНерабочегоВремени = Дата("00010101000000");
		
	Иначе
		
		Объект.ДлинаРабочегоВремени   = Дата("00010101000000");
		ДлинаНерабочегоВремени = Дата("00010101000000");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоказателиВремениНаСервере()
	
	Если Объект.ОкончаниеИнтервала < Объект.НачалоИнтервала Тогда	
		
		ОкончаниеИнтервала = Объект.ОкончаниеИнтервала + 86400;
		
	Иначе
		
		ОкончаниеИнтервала = Объект.ОкончаниеИнтервала;
		
	КонецЕсли;
	
	РазностьВСекундах = ОкончаниеИнтервала - Объект.НачалоИнтервала;
	
	Если РазностьВСекундах > 0 Тогда
		
		ДлинаНерабочегоВремениВСекундах   = ОбщегоНазначенияРТКлиентСервер.ПреобразоватьСекундыВДату(РазностьВСекундах) - Объект.ДлинаРабочегоВремени;
		
		Если ДлинаНерабочегоВремениВСекундах > 0 Тогда
			
			ДлинаНерабочегоВремени = ОбщегоНазначенияРТКлиентСервер.ПреобразоватьСекундыВДату(ДлинаНерабочегоВремениВСекундах);
			
		Иначе
			
			ДлинаНерабочегоВремени = Дата("00010101000000");
			
		КонецЕсли;
		
	Иначе
		
		ДлинаНерабочегоВремени = Дата("00010101000000");
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура рассчитывает рабочее время.
//
&НаКлиенте
Процедура РассчитатьНерабочееВремя() 
	
	
	Объект.НачалоИнтервала    = Дата(1,1,1,Час(Объект.НачалоИнтервала),Минута(Объект.НачалоИнтервала),0);
	Объект.ОкончаниеИнтервала = Дата(1,1,1,Час(Объект.ОкончаниеИнтервала),Минута(Объект.ОкончаниеИнтервала),0);
	
	Если Объект.ОкончаниеИнтервала < Объект.НачалоИнтервала Тогда
		
		ОкончаниеИнтервала = Объект.ОкончаниеИнтервала + 86400;
		
	Иначе
		
		ОкончаниеИнтервала = Объект.ОкончаниеИнтервала;
		
	КонецЕсли;
	
	РазностьВСекундах = ОкончаниеИнтервала - Объект.НачалоИнтервала;
	
	Если РазностьВСекундах > 0 Тогда
		
		ДлинаНерабочегоВремениВСекундах   = ОбщегоНазначенияРТКлиентСервер.ПреобразоватьСекундыВДату(РазностьВСекундах) - Объект.ДлинаРабочегоВремени;
		
		Если ДлинаНерабочегоВремениВСекундах < 0 Тогда
			
			ОбновитьПоказателиВремени();
			
		Иначе
			
			ДлинаНерабочегоВремени = ОбщегоНазначенияРТКлиентСервер.ПреобразоватьСекундыВДату(ДлинаНерабочегоВремениВСекундах);
			
		КонецЕсли;
		
		
	Иначе
		
		Объект.ДлинаРабочегоВремени   = Дата("00010101000000");
		ДлинаНерабочегоВремени = Дата("00010101000000");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСписокДнейНедели(ТекущийОбъект)
	
	ТекущийОбъект.ДниНедели.Очистить();
	
	Для каждого ДеньНедели Из ДниНеделиСписок Цикл
		
		Если ДеньНедели.Пометка Тогда
		
		СтрокаДеньНедели = ТекущийОбъект.ДниНедели.Добавить();
		СтрокаДеньНедели.ДеньНедели = ДеньНедели.Значение;
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
